/*
╔═╦═╦╗─╔╦═╦╗╔══╦══╦═╗╔═╦═╦══╗
║║║║║╚╦╝║╦╣║║╔╗║══╣╦╝║║║║╠╗╗║
║║║║╠╗║╔╣╩╣╚╣╠╣╠══║╩╗║║║║╠╩╝║
╚╩═╩╝╚═╝╚═╩═╩╝╚╩══╩═╝╚╩═╩╩══╝
*/


const config = require('../config')
const { cmd, commands } = require('../command');

cmd({
    pattern: "list",
    alias: ["listcmd","menu3","commands"],
    desc: "menu the bot",
    category: "menu",
    react: "⏳",
    filename: __filename
}, 
async (conn, mek, m, { from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply }) => {
    try {
        let dec = `╭━ ⟮ *𝗠𝘃𝗲𝗹𝗮𝘀𝗲 𝗠𝗗 𝗗𝗼𝘄𝗻𝗹𝗼𝗮𝗱 𝗖𝗠𝗗✅* ⟯ ━┈⊷
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘱𝘭𝘢𝘺
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘮𝘶𝘴𝘪𝘤 𝘧𝘳𝘰𝘮 𝘺𝘰𝘶𝘵𝘶𝘣𝘦
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘰𝘯𝘨
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘴𝘰𝘯𝘨 𝘧𝘳𝘰𝘮 𝘺𝘰𝘶𝘵𝘶𝘣𝘦
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘢𝘱𝘬
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘢𝘱𝘬 𝘧𝘳𝘰𝘮 𝘱𝘭𝘢𝘺𝘴𝘵𝘰𝘳𝘦
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘷𝘪𝘥𝘦𝘰
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘷𝘪𝘥𝘦𝘰 𝘧𝘳𝘰𝘮 𝘺𝘰𝘶𝘵𝘶𝘣𝘦
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘧𝘣
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘷𝘪𝘥𝘦𝘰 𝘧𝘳𝘰𝘮 𝘧𝘢𝘤𝘦𝘣𝘰𝘰𝘬
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘵𝘬
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘷𝘪𝘥𝘦𝘰 𝘧𝘳𝘰𝘮 𝘵𝘪𝘬𝘵𝘰𝘬
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘪𝘨
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘷𝘪𝘥𝘦𝘰 𝘧𝘳𝘰𝘮 𝘪𝘨
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘨𝘥𝘳𝘪𝘷𝘦
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘨𝘥𝘳𝘪𝘷𝘦 𝘧𝘪𝘭𝘦𝘴
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘵𝘸𝘪𝘵𝘵𝘦𝘳
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘪𝘮𝘢𝘨𝘦 𝘧𝘳𝘰𝘮 𝘵𝘸𝘪𝘵𝘵𝘦𝘳
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘪𝘮𝘨
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘪𝘮𝘢𝘨𝘦
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘥𝘢𝘳𝘢𝘮𝘢
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘧𝘶𝘭𝘭 𝘦𝘱𝘪𝘴𝘰𝘥𝘦 𝘷𝘪𝘥𝘦𝘰
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘱𝘭𝘢𝘺2
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘴𝘰𝘯𝘨 𝘧𝘳𝘰𝘮 𝘺𝘰𝘶𝘵𝘶𝘣𝘦
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘷𝘪𝘥𝘦𝘰2
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘷𝘪𝘥𝘦𝘰 𝘧𝘳𝘰𝘮 𝘺𝘰𝘶𝘵𝘶𝘣𝘦
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘣𝘢𝘪𝘴𝘤𝘰𝘱𝘦
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘷𝘪𝘥𝘦𝘰 𝘧𝘳𝘰𝘮 𝘣𝘢𝘪𝘴𝘤𝘰𝘱𝘦
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘮𝘦𝘥𝘪𝘢𝘧𝘪𝘳𝘦
┃▸ℹ️ 𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥 𝘮𝘦𝘥𝘪𝘢𝘧𝘪𝘳𝘦 𝘧𝘪𝘭𝘦𝘴
╰━━━━━───━─━━━━⚈

╭━ ⟮ *𝗔𝗻𝗶𝗺𝗲 𝗖𝗼𝗺𝗺𝗮𝗻𝗱𝘀* ⟯ ━┈⊷
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘺𝘵𝘴
┃▸ℹ️ 𝘴𝘦𝘢𝘳𝘤𝘩 𝘷𝘪𝘥𝘦𝘰𝘴 𝘰𝘯 𝘺𝘰𝘶𝘵𝘶𝘣𝘦
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘬𝘪𝘯𝘨
┃▸ℹ️ 𝘨𝘦𝘵 𝘬𝘪𝘯𝘨 𝘪𝘯𝘧𝘰
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘥𝘰𝘨
┃▸ℹ️ 𝘨𝘦𝘵 𝘳𝘢𝘯𝘥𝘰𝘮 𝘥𝘰𝘨 𝘱𝘪𝘤𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘢𝘯𝘪𝘮𝘦
┃▸ℹ️ 𝘨𝘦𝘵 𝘢𝘯𝘪𝘮𝘦 𝘱𝘪𝘤𝘴
┃⸔
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘢𝘯𝘪𝘮𝘦 𝘨𝘪𝘳𝘭
┃▸ℹ️ 𝘨𝘦𝘵 𝘢𝘯𝘪𝘮𝘦 𝘨𝘪𝘳𝘭 𝘱𝘪𝘤𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘭𝘰𝘭𝘪
┃▸ℹ️ 𝘨𝘦𝘵 𝘳𝘰𝘮𝘢𝘯𝘵𝘪𝘤 𝘢𝘯𝘪𝘮𝘦 𝘱𝘪𝘤𝘴
╰━━━━━───━─━━━━⚈

╭━ ⟮‍ *𝗠𝘃𝗲𝗹𝗮𝘀𝗲 𝗠𝗗 𝗜𝗻𝗳𝗼 𝗖𝗠𝗗* ⟯ ━┈⊷
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘢𝘭𝘪𝘷𝘦
┃▸ℹ️ 𝘤𝘩𝘦𝘤𝘬 𝘣𝘰𝘵 𝘰𝘯𝘭𝘪𝘯𝘦 𝘰𝘳 𝘰𝘧𝘧𝘭𝘪𝘯𝘦
┃▸  
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘱𝘪𝘯𝘨
┃▸ℹ️ 𝘤𝘩𝘦𝘤𝘬 𝘣𝘰𝘵 𝘴𝘱𝘦𝘦𝘥
┃▸  
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘮𝘦𝘯𝘶
┃▸ℹ️ 𝘮𝘷𝘦𝘭𝘢𝘴𝘦 𝘮𝘦𝘯𝘶
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘮𝘦𝘯𝘶2
┃▸ℹ️ 𝘮𝘷𝘦𝘭𝘢𝘴𝘦 𝘮𝘦𝘯𝘶2
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘢𝘪
┃▸ℹ️ 𝘤𝘩𝘢𝘵 𝘸𝘪𝘵𝘩 𝘢𝘪 𝘣𝘰𝘵
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘺𝘴𝘵𝘦𝘮
┃▸ℹ️ 𝘤𝘩𝘦𝘤𝘬 𝘣𝘰𝘵 𝘴𝘺𝘴𝘵𝘦𝘮
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘰𝘸𝘯𝘦𝘳
┃▸ℹ️ 𝘨𝘦𝘵 𝘰𝘸𝘯𝘦𝘳 𝘪𝘯𝘧𝘰
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘵𝘢𝘵𝘶𝘴
┃▸ℹ️ 𝘤𝘩𝘦𝘤𝘬 𝘣𝘰𝘵 𝘳𝘶𝘯𝘵𝘪𝘮𝘦
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘢𝘣𝘰𝘶𝘵
┃▸ℹ️ 𝘨𝘦𝘵 𝘢𝘣𝘰𝘶𝘵 𝘪𝘯𝘧𝘰
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘭𝘪𝘴𝘵
┃▸ℹ️ 𝘨𝘦𝘵 𝘮𝘷𝘦𝘭𝘢𝘴𝘦 𝘤𝘰𝘮𝘮𝘢𝘯𝘥𝘴 𝘭𝘪𝘴𝘵𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘤𝘳𝘪𝘱𝘵
┃▸ℹ️ 𝘨𝘦𝘵 𝘮𝘷𝘦𝘭𝘢𝘴𝘦 𝘮𝘥 𝘳𝘦𝘱𝘰𝘴𝘪𝘵𝘰𝘳𝘺
╰━━━━━───━─━━━━⚈

╭━ ⟮ *𝗢𝘁𝗵𝗲𝗿 𝗖𝗼𝗺𝗺𝗮𝗻𝗱𝘀* ⟯ ━┈⊷
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: 𝘫𝘰𝘬𝘦
┃▸ℹ️ 𝘨𝘦𝘵 𝘳𝘢𝘯𝘥𝘰𝘮 𝘫𝘰𝘬𝘦
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘧𝘢𝘤𝘵
┃▸ℹ️ 𝘨𝘦𝘵 𝘳𝘢𝘯𝘥𝘰𝘮 𝘧𝘢𝘤𝘵
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘨𝘪𝘵𝘩𝘴𝘵𝘢𝘭𝘬 
┃▸ℹ️ 𝘨𝘦𝘵 𝘨𝘪𝘵𝘩𝘶𝘣 𝘥𝘢𝘵𝘢
┃▸ 
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘨𝘱𝘢𝘴𝘴
┃▸ℹ️ 𝘨𝘦𝘵 𝘢 𝘴𝘵𝘳𝘰𝘯𝘨 𝘱𝘢𝘴𝘴𝘸𝘰𝘳𝘥
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘩𝘢𝘤𝘬
┃▸ℹ️ 𝘱𝘳𝘢𝘯𝘬 𝘸𝘪𝘵𝘩 𝘧𝘳𝘪𝘦𝘯𝘥𝘴 
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘳𝘦𝘱𝘰
┃▸ℹ️ 𝘴𝘦𝘢𝘳𝘤𝘩 𝘳𝘦𝘱𝘰𝘴𝘪𝘵𝘰𝘳𝘺
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘥𝘦𝘧𝘪𝘯𝘦
┃▸ℹ️ 𝘴𝘦𝘢𝘳𝘤𝘩 𝘸𝘰𝘳𝘥𝘴
╰━━━━━───━─━━━━⚈

╭━ ⟮ *𝗚𝗿𝗼𝘂𝗽 𝗖𝗼𝗺𝗺𝗮𝗻𝗱𝘀* ⟯ ━┈⊷
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘮𝘶𝘵𝘦
┃▸ℹ️ 𝘮𝘶𝘵𝘦 𝘨𝘳𝘰𝘶𝘱
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘶𝘮𝘶𝘵𝘦
┃▸ℹ️ 𝘶𝘯𝘮𝘶𝘵𝘦 𝘨𝘳𝘰𝘶𝘱
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘭𝘦𝘧𝘵
┃▸ℹ️ 𝘭𝘦𝘧𝘵 𝘨𝘳𝘰𝘶𝘱
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘫𝘪𝘥
┃▸ℹ️ 𝘨𝘳𝘰𝘶𝘱 𝘫𝘪𝘥
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘳𝘦𝘮𝘰𝘷𝘦
┃▸ℹ️ 𝘳𝘦𝘮𝘰𝘷𝘦 𝘮𝘦𝘮𝘣𝘦𝘳 𝘧𝘳𝘰𝘮 𝘵𝘩𝘦 𝘨𝘳𝘰𝘶𝘱
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘥𝘦𝘭𝘦𝘵𝘦 
│⸔ 𝘥𝘦𝘭𝘦𝘵𝘦 𝘤𝘩𝘢𝘵𝘴  
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘢𝘥𝘥
┃▸ℹ️ 𝘢𝘥𝘥 𝘮𝘦𝘮𝘣𝘦𝘳 𝘵𝘰 𝘢 𝘨𝘳𝘰𝘶𝘱
┃⸔
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘬𝘪𝘤𝘬
┃▸ℹ️ 𝘬𝘪𝘤𝘬 𝘢𝘯𝘺 𝘶𝘴𝘦𝘳
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘬𝘪𝘤𝘬𝘢𝘭𝘭
┃▸ℹ️  𝘳𝘦𝘮𝘰𝘷𝘦 𝘢𝘭𝘭 𝘮𝘦𝘮𝘣𝘦𝘳𝘴 𝘰𝘯 𝘢 𝘨𝘳𝘰𝘶𝘱
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘦𝘵𝘨𝘰𝘰𝘥𝘣𝘺𝘦
┃▸ℹ️ 𝘴𝘦𝘵 𝘭𝘦𝘢𝘷𝘦 𝘴𝘮𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘦𝘵𝘸𝘦𝘭𝘤𝘰𝘮𝘦
┃▸ℹ️ 𝘴𝘦𝘵 𝘸𝘦𝘭𝘤𝘰𝘮𝘦 𝘴𝘮𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: 𝘱𝘳𝘰𝘮𝘰𝘵𝘦 
┃▸ℹ️ 𝘮𝘢𝘬𝘦 𝘢𝘥𝘮𝘪𝘯
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘥𝘦𝘮𝘰𝘵𝘦
┃▸ℹ️ 𝘥𝘪𝘴𝘮𝘪𝘴𝘴 𝘢𝘥𝘯𝘪𝘮
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘵𝘢𝘨𝘢𝘭𝘭
┃▸ℹ️ 𝘵𝘢𝘨𝘢𝘭𝘭 𝘨𝘳𝘰𝘶𝘱 𝘮𝘦𝘮𝘣𝘦𝘳𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘨𝘦𝘵𝘱𝘪𝘤
┃▸ℹ️ 𝘨𝘦𝘵 𝘨𝘳𝘰𝘶𝘱 𝘱𝘳𝘰𝘧𝘪𝘭𝘦
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘪𝘯𝘷𝘪𝘵𝘦
┃▸ℹ️ 𝘴𝘦𝘵 𝘨𝘳𝘰𝘶𝘱 𝘭𝘪𝘯𝘬
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘳𝘦𝘷𝘰𝘬𝘦
┃▸ℹ️ 𝘳𝘦𝘴𝘦𝘵 𝘨𝘳𝘰𝘶𝘱 𝘭𝘪𝘯𝘬
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘫𝘰𝘪𝘯𝘳𝘦𝘲𝘶𝘦𝘴𝘵𝘴
┃▸ℹ️ 𝘢𝘱𝘱𝘳𝘰𝘷𝘦 𝘱𝘦𝘯𝘥𝘪𝘯𝘨 𝘳𝘦𝘲𝘶𝘦𝘴𝘵𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘢𝘭𝘭𝘳𝘦𝘲
┃▸ℹ️ 𝘢𝘥𝘥 𝘱𝘦𝘯𝘥𝘪𝘯𝘨 𝘮𝘦𝘮𝘣𝘦𝘳𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘭𝘰𝘤𝘬𝘨𝘤
┃▸ℹ️ 𝘭𝘰𝘤𝘬 𝘨𝘳𝘰𝘶𝘱
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘶𝘯𝘭𝘰𝘤𝘬𝘨𝘤
┃▸ℹ️ 𝘶𝘯𝘭𝘰𝘤𝘬 𝘢𝘭𝘭 𝘨𝘳𝘰𝘶𝘱𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘭𝘦𝘢𝘷𝘦
┃▸ℹ️ 𝘭𝘦𝘢𝘷𝘦 𝘢𝘯𝘺 𝘨𝘳𝘰𝘶𝘱 
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘶𝘱𝘥𝘢𝘵𝘦𝘨𝘯𝘦
┃▸ℹ️ 𝘴𝘦𝘵 𝘨𝘳𝘰𝘶𝘱 𝘯𝘢𝘮𝘦
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘦𝘵 𝘨𝘳𝘰𝘶𝘱 𝘥𝘦𝘴𝘤𝘳𝘪𝘱𝘵𝘪𝘰𝘯
┃▸ℹ️ 𝘴𝘦𝘵 𝘨𝘳𝘰𝘶𝘱 𝘥𝘦𝘴𝘤𝘳𝘪𝘱𝘵𝘪𝘰𝘯
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘫𝘰𝘪𝘯
┃▸ℹ️ 𝘫𝘰𝘪𝘯 𝘪𝘯𝘷𝘪𝘵𝘦 𝘭𝘪𝘯𝘬
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘩𝘪𝘥𝘦𝘵𝘢𝘨
┃▸ℹ️ 𝘮𝘦𝘯𝘵𝘪𝘰𝘯 𝘢𝘯𝘺 𝘶𝘴𝘦 𝘵𝘢𝘨
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘨𝘪𝘯𝘵𝘰
┃▸ℹ️ 𝘨𝘦𝘵 𝘨𝘳𝘰𝘶𝘱 𝘪𝘯𝘧𝘰𝘳𝘮𝘢𝘵𝘪𝘰𝘯 
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘥𝘪𝘴𝘢𝘱𝘱𝘦𝘢𝘳 𝘰𝘯 
┃▸ℹ️ 𝘰𝘯 𝘥𝘪𝘴𝘢𝘱𝘱𝘦𝘢𝘳 𝘴𝘮𝘴 𝘰𝘯 𝘨𝘳𝘰𝘶𝘱𝘴 
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘥𝘪𝘴𝘢𝘱𝘱𝘦𝘢𝘳 𝘰𝘧𝘧
┃▸ℹ️ 𝘰𝘧𝘧 𝘥𝘪𝘴𝘢𝘱𝘱𝘦𝘢𝘳 𝘴𝘮𝘴 𝘰𝘯 𝘨𝘳𝘰𝘶𝘱𝘴 
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘦𝘯𝘥𝘥𝘮
┃▸ℹ️ 𝘥𝘪𝘴𝘢𝘱𝘱𝘦𝘢𝘳 
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘥𝘪𝘴𝘢𝘱𝘱𝘦𝘢𝘳90d
┃▸ℹ️ 𝘴𝘦𝘵 𝘵𝘪𝘮𝘦 𝘵𝘰 𝘤𝘭𝘦𝘢𝘳 𝘴𝘮𝘴
╰━━━━━───━─━━━━⚈

╭━ ⟮ *𝗢𝘄𝗻𝗲𝗿 𝗖𝗼𝗺𝗺𝗮𝗻𝗱𝘀* ⟯ ━┈⊷
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘶𝘱𝘥𝘢𝘵𝘦
┃▸ℹ️ 𝘶𝘱𝘥𝘢𝘵𝘦 𝘣𝘰𝘵 𝘷𝘢𝘭𝘶𝘦 
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘳𝘦𝘴𝘵𝘢𝘳𝘵
┃▸ℹ️ 𝘳𝘦𝘴𝘵𝘢𝘳𝘵 𝘺𝘰𝘶𝘳 𝘣𝘰𝘵
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘦𝘵𝘵𝘪𝘯𝘨𝘴
┃▸ℹ️ 𝘴𝘦𝘦 𝘣𝘰𝘵 𝘴𝘦𝘵𝘵𝘪𝘯𝘨𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘰𝘸𝘯𝘦𝘳 
┃▸ℹ️ 𝘨𝘦𝘵 𝘰𝘸𝘯𝘦𝘳 𝘥𝘦𝘵𝘢𝘪𝘭𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘳𝘦𝘱𝘰
┃▸ℹ️ 𝘨𝘦𝘵 𝘮𝘷𝘦𝘭𝘢𝘴𝘦 𝘮𝘥 𝘳𝘦𝘱𝘰𝘴𝘪𝘵𝘰𝘳𝘺
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘺𝘴𝘵𝘦𝘮
┃▸ℹ️ 𝘤𝘩𝘦𝘤𝘬 𝘣𝘰𝘵 𝘴𝘺𝘴𝘵𝘦𝘮
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘣𝘭𝘰𝘤𝘬
┃▸ℹ️ 𝘣𝘭𝘰𝘤𝘬 𝘢𝘯𝘺 𝘶𝘴𝘦𝘳 
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘶𝘯𝘣𝘭𝘰𝘤𝘬
┃▸ℹ️ 𝘶𝘯𝘣𝘭𝘰𝘤𝘬 𝘢𝘯𝘺 𝘶𝘴𝘦𝘳
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘩𝘶𝘵𝘥𝘰𝘸𝘯
┃▸ℹ️ 𝘭𝘰𝘨𝘰𝘶𝘵 𝘺𝘰𝘶𝘳 𝘣𝘰𝘵
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘤𝘭𝘦𝘢𝘳𝘤𝘩𝘢𝘵𝘴
┃▸ℹ️ 𝘤𝘭𝘦𝘢𝘳𝘤𝘩𝘢𝘵𝘴
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘴𝘦𝘵𝘱𝘱
┃▸ℹ️ 𝘶𝘱𝘥𝘢𝘵𝘦 𝘱𝘳𝘰𝘧𝘪𝘭𝘦 𝘱𝘪𝘤
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘣𝘳𝘰𝘢𝘥𝘤𝘢𝘴𝘵
┃▸ℹ️𝘤𝘳𝘦𝘢𝘵𝘦 𝘣𝘳𝘰𝘢𝘥𝘤𝘢𝘴𝘵
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘫𝘪𝘥
┃▸ℹ️ 𝘨𝘦𝘵 𝘫𝘪𝘥 𝘶𝘴𝘦𝘳
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘨𝘫𝘪𝘥
┃▸ℹ️ 𝘨𝘦𝘵 𝘨𝘳𝘰𝘶𝘱 𝘫𝘪𝘥
╰━━━━━───━─━━━━⚈

╭━ ⟮ *𝗖𝗼𝗻𝘃𝗲𝗿𝘁 𝗖𝗼𝗺𝗺𝗮𝗻𝗱𝘀* ⟯ ━┈⊷
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .s𝘵𝘪𝘤𝘬𝘦𝘳
┃▸ℹ️ 𝘤𝘰𝘯𝘷𝘦𝘳𝘵 𝘱𝘩𝘰𝘵𝘰 𝘵𝘰 𝘴𝘵𝘪𝘤𝘬𝘦𝘳
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘵𝘵𝘴
┃▸ℹ️ 𝘤𝘩𝘢𝘯𝘨𝘦 𝘵𝘦𝘹𝘵 𝘵𝘰 𝘢𝘶𝘥𝘪𝘰
┃▸
┃▸📖 ☎𝗖𝗢𝗠𝗠𝗔𝗡𝗗: .𝘵𝘳𝘵
┃▸ℹ️ 𝘤𝘩𝘢𝘯𝘨𝘦 𝘭𝘢𝘯𝘨𝘶𝘢𝘨𝘦𝘴
╰━━━━━───━──━━━━⚈
>  *𝗗𝗲𝘃𝗲𝗹𝗼𝗽𝗲𝗿/𝗠𝘃𝗲𝗹𝗮𝘀𝗲 𝗠𝗗 𝗧𝗲𝗰𝗵𝗻𝗼𝗹𝗼𝗴𝘆☎*`;

        await conn.sendMessage(
            from,
            {
                image: { url: `https://files.catbox.moe/7a63r4.png` },
                caption: dec,
                contextInfo: {
                    mentionedJid: [m.sender],
                    forwardingScore: 999,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363321103874131@newsletter',
                        newsletterName: 'ᴍᴠᴇʟᴀsᴇ ᴍᴅ',
                        serverMessageId: 143
                    }
                }
            },
            { quoted: mek }
        );

        // Send audio
        await conn.sendMessage(from, {
            audio: { url: 'https://github.com/JawadYTX/KHAN-DATA/raw/refs/heads/main/autovoice/sigma.m4a' },
            mimetype: 'audio/mp4',
            ptt: true
        }, { quoted: mek });
        
    } catch (e) {
        console.log(e);
        reply(`${e}`);
    }
});
